# ScheduleFormatParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ScheduleFormatParam Property
ParameterTypeId Class See Also
---
"Formatting"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ScheduleFormatParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ScheduleFormatParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ScheduleFormatParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace